# boolean row selection by values

In [3]:
import pandas as pd

In [4]:
data={
    "Name":["A","B","C","D","E","F"],
    "Age":[25,30,35,40,45,50],
    "City":["New york","Paris","London","Berlin","Paris","London"],
    "Salary":[50000,60000,70000,80000,90000,100000]
}
df=pd.DataFrame(data)
df

  Name  Age      City  Salary
0    A   25  New york   50000
1    B   30     Paris   60000
2    C   35    London   70000
3    D   40    Berlin   80000
4    E   45     Paris   90000
5    F   50    London  100000

In [5]:
df[df["Age"]>35]

  Name  Age    City  Salary
3    D   40  Berlin   80000
4    E   45   Paris   90000
5    F   50  London  100000

In [6]:
df[df["Age"]<35]

  Name  Age      City  Salary
0    A   25  New york   50000
1    B   30     Paris   60000

In [12]:
df[df["City"]=="Paris"]

  Name  Age   City  Salary
1    B   30  Paris   60000
4    E   45  Paris   90000

In [9]:
df[df["Age"]==35]

  Name  Age    City  Salary
2    C   35  London   70000

# And conditon(&)

In [10]:

df[(df["Age"]>35) & (df["City"]=="Paris")]

  Name  Age   City  Salary
4    E   45  Paris   90000

# or conditon(|)

In [11]:
# or conditon(|)
df[(df["Age"]<35) | (df["City"]=="Paris")]

  Name  Age      City  Salary
0    A   25  New york   50000
1    B   30     Paris   60000
4    E   45     Paris   90000

# is in () condition

In [15]:
df[df["City"].isin(["Paris","Hyderabad"])]

  Name  Age   City  Salary
1    B   30  Paris   60000
4    E   45  Paris   90000

# not in (~)---> (with is in())

In [16]:
df[~df["City"].isin(["Paris","Hyderabad"])] # give other than we mentioned citys

  Name  Age      City  Salary
0    A   25  New york   50000
2    C   35    London   70000
3    D   40    Berlin   80000
5    F   50    London  100000

# str.contains

In [17]:
df[df["City"].str.contains("on")]

  Name  Age    City  Salary
2    C   35  London   70000
5    F   50  London  100000

In [18]:
#  string not contains
df[~df["City"].str.contains("on")]

  Name  Age      City  Salary
0    A   25  New york   50000
1    B   30     Paris   60000
3    D   40    Berlin   80000
4    E   45     Paris   90000

# Between

In [19]:
df[df["Age"].between(30,45)]

  Name  Age    City  Salary
1    B   30   Paris   60000
2    C   35  London   70000
3    D   40  Berlin   80000
4    E   45   Paris   90000

#  notBetween

In [20]:
df[~df["Age"].between(30,45)]

  Name  Age      City  Salary
0    A   25  New york   50000
5    F   50    London  100000

# Startswith

In [21]:
df[df["City"].str.startswith("N")]

  Name  Age      City  Salary
0    A   25  New york   50000

#  N0t StartswithÂ¶

In [22]:
df[~df["City"].str.startswith("N")]

  Name  Age    City  Salary
1    B   30   Paris   60000
2    C   35  London   70000
3    D   40  Berlin   80000
4    E   45   Paris   90000
5    F   50  London  100000

# Ends with

In [25]:
df[df["City"].str.endswith("n")]

  Name  Age    City  Salary
2    C   35  London   70000
3    D   40  Berlin   80000
5    F   50  London  100000

# Not Ends with

In [26]:
df[~df["City"].str.endswith("n")]

  Name  Age      City  Salary
0    A   25  New york   50000
1    B   30     Paris   60000
4    E   45     Paris   90000

In [27]:
# age>30,city=london,salary>70000
df[(df["Age"]>30) & (df["City"]=="London") & (df["Salary"]>70000)]

  Name  Age    City  Salary
5    F   50  London  100000

# Droping Duplicates in Row Index